{
  "Title": "The Proud Princess",
  "Year": "2022",
  "Rated": "N/A",
  "Released": "N/A",
  "Runtime": "N/A",
  "Genre": "Animation, Comedy, Family",
  "Director": "Radek Beran",
  "Writer": "Radek Beran, Henryk Bloch, Oldrich Kautský",
  "Actors": "N/A",
  "Plot": "The black-and-white fairy tale The Proud Princess was one of the most viewed films in the Czech cinema of all times. Punished pride is one of the most beautiful fairy tales by Bozena Nemcová. No wonder the most successful Czech live-action fairy tale movie of all times was based on it. This is an animated remake. Krasomila lives in a golden cage. She's childishly proud and her mean advisers support her in that. They want to marry her to a weakling and keep power. However, they come across Miroslav, the righteous king of the neighboring kingdom. He falls in love with princess Krasomila a decides to cure her of her pride. Disquised as a gardener, he manages to do so. Then they flee together before the rage of the advisers to his kingdom. Their way is full of wild adventures, which bring them closer together. Krasomila has no idea that the gardener she's running away with is a king. She finds out in the grand finale. She forgives Miroslav denying his true origin and marries him. The advisers are driven out and love triumphs.",
  "Language": "Czech",
  "Country": "Czech Republic",
  "Awards": "N/A",
  "Poster": "https://m.media-amazon.com/images/M/MV5BZDgxZmViOTctN2EwNy00YWMwLWEyNWMtMmYwMDJjOTYyNmZlXkEyXkFqcGdeQXVyMTA2NTQ2MTM5._V1_SX300.jpg",
  "Ratings": [],
  "Metascore": "N/A",
  "imdbRating": "N/A",
  "imdbVotes": "N/A",
  "imdbID": "tt10996076",
  "Type": "movie",
  "DVD": "N/A",
  "BoxOffice": "N/A",
  "Production": "N/A",
  "Website": "N/A",
  "Response": "True",
  "crawl_note": {
    "gov_id": "31796",
    "gov_title_zh": "傲嬌公主的奇幻冒險",
    "gov_title_en": "The Proud Princess",
    "imdb_id": "tt10996076",
    "source": "omdb",
    "fetch_mode": "by_imdb_id_from_manual_fix",
    "week_label": "2025W41",
    "year_label": "2025",
    "fetched_at": "2025-10-28 12:29:57"
  }
}